all-posts.org
#+STARTUP: content
#+AUTHOR: Robert Clay
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t
*** DONE MaxMSP hold switch
    :PROPERTIES:
    :EXPORT_FILE_NAME: MaxMSP-hold-switch
    :EXPORT_DATE: 2021-01-03
    :END:
   [2021-01-03 Sun],#MaxMSP
**** Making your own tools can be a rewarding challenge

Being a computer musician, I appreciate the ability to work with data as it suits me. I don't need to just accept a stream of midi and ask a software synthesizer to make sounds for me. I can manipulate that stream of data in interesting ways before I put it to use. One such use I found for this manipulation is replicating a feature of a keyboard I sold a few years back.

I used to own a Roland JD-XA. It was a real analogue synth with some modern and cool features. Sadly, my audio recording set up was not up to doing it justice, and I ended up using it mostly as a controller. I sold it to get a Roli Seaboard instead and I am very happy with it. But I did miss a button on its front panel; the "hold" switch that went with the arpeggiator. The switch when used with the arpeggiator let you hold out the notes in a sequence even when you took your hands off the keys, but I liked the fact it wasn't tied to the arpeggiator itself. When it wasn't used with the arpeggiator, it acted like an "auto-sustain-pedal". Notes played legato were all sustained, and a new "set" of notes would trigger a re-pedal and the next set of notes would sustain while the old notes would stop. It was super fun to use in conjunction with a two tier keyboard set up. I could play a piano like patch in my lower keyboard while the top board would be set to some sustaining patch that I could play a few notes on without needing to stand on a sustain pedal the whole time.

I was thinking I might be able to get something similar from other arpeggiators, so I didn't think much of it when I sold the board. But after a few attempts with a few arpeggiator plugins, I quickly realized that this wasn't how most arpeggiators worked. But I also knew I had Max4Live. I figured I could just make my own.

**** What I wanted to make

Before I get into how I started trying to make this, I want to spell out exactly how it was supposed to work.

+ A "mode" needed to be enabled and easy to turn off.
+ That mode needed to know when notes were still being played or not
+ All note offs needed to be captured and handled in a special way
+ If there were no notes being held, a list of note offs for the currently sustaining notes would be to be calculated and sent before the new note on.

On the surface it seemed to be a really simple problem. Very clear order of operations, nothing that was too complicated, I thought it would take me 30 minutes to whip something up. Boy was I wrong.

**** The first few tries did not go well

My first attempt quickly spiraled out of control into a mess of complexity.
Generating a list of notes that were currently being held down on a keyboard
connected to this utility proved really hard to make and deal with. I had
considered making a dictionary where I added note-on events as entries and
note-off events as a sign to remove the entry. But having worked with some
Clojure at this point I wanted a solution that didn't rely on something mutable like this "dictionary" I was planning on using. Writing the "state of the midi stream" with each new event lead to a huge mess of operation order. Do I read the dictionary before of after I compare the note coming in to the others to see if it's a note already in the list? Should the dictionary read be part of the clean up at the end of the chain? When does the note off list get generated? How I can generate that list without having the dictionary pass its contents all over the place? Do I need the contents of the dictionary in multiple places? It was a disaster.

Imagining the problem was Max, I proceeded to wire up Max and Node and ClojureScript, hoping that a different language would have better support for what I was trying to do. But after spending more time with Max, I found a better way forward.

**** But then I found out Max had already solved the problem for me

Max has an object that simulates what a sustain pedal does. While the "pedal" is down, all note offs are kept back. And when you send it the right message, all the current notes are ended with their corresponding note-off messages. This object solved 50% of what I was trying to do. I no longer needed to handle the creation of the note off messages. It even gave me a set of configurations for working with note-on overlap. I had originally split the midi note messages into note-on and note-off messages because I assumed I needed to count them to know how many notes were being held down, but it turns out there was a Max object for that too. Borax is an interestingly named object that reports various things about the state of a stream of midi. One of those bits of information is how many notes are currently "being held" from the stream of data.

So to wire it all up I only needed to:
+ check to see the number of notes held now.
+ If zero, open a gate
+ Bang on the gate. If it's open send start the sequence to send the notes offs.
+ The notes-off messages are send by controlling something like a sustain pedal, so using a delay I "lift" and "depress" the sustain pedal.
+ Pass along the midi message to then "sustain object".

Now that it's all finished, I can call up a bit of code that runs in Ableton
Live with just a few keystrokes whenever I want to. It replicates what my old
keyboard used to do, but with the flexibility of being implemented in MaxMSP
coda rather than tied up in a piece of hardware. I learned a lot about Max and
I hope this makes my next project that much easier to get started on.
