content/blog/MaxMSP-hold-switch.md


## The MaxMSP object for those interested {#the-maxmsp-object-for-those-interested}

```text
{
	"boxes" : [ 		{
			"box" : 			{
				"maxclass" : "newobj",
				"text" : "patcher hold-switch",
				"numinlets" : 3,
				"numoutlets" : 1,
				"id" : "obj-46",
				"outlettype" : [ "int" ],
				"patching_rect" : [ 712.000016808509827, 413.666671216487885, 145.0, 24.0 ],
				"patcher" : 				{
					"fileversion" : 1,
					"appversion" : 					{
						"major" : 8,
						"minor" : 1,
						"revision" : 8,
						"architecture" : "x64",
						"modernui" : 1
					}
,
					"classnamespace" : "box",
					"rect" : [ 1059.0, 84.0, 955.0, 1003.0 ],
					"bglocked" : 0,
					"openinpresentation" : 0,
					"default_fontsize" : 12.0,
					"default_fontface" : 0,
					"default_fontname" : "Arial",
					"gridonopen" : 1,
					"gridsize" : [ 15.0, 15.0 ],
					"gridsnaponopen" : 1,
					"objectsnaponopen" : 1,
					"statusbarvisible" : 2,
					"toolbarvisible" : 1,
					"lefttoolbarpinned" : 0,
					"toptoolbarpinned" : 0,
					"righttoolbarpinned" : 0,
					"bottomtoolbarpinned" : 0,
					"toolbars_unpinned_last_save" : 0,
					"tallnewobj" : 0,
					"boxanimatetime" : 200,
					"enablehscroll" : 1,
					"enablevscroll" : 1,
					"devicewidth" : 0.0,
					"description" : "",
					"digest" : "",
					"tags" : "",
					"style" : "",
					"subpatcher_template" : "Default Max 7",
					"assistshowspatchername" : 0,
					"boxes" : [ 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "unpack",
								"numinlets" : 1,
								"numoutlets" : 2,
								"id" : "obj-6",
								"outlettype" : [ "int", "int" ],
								"patching_rect" : [ 319.333338856697083, 340.0, 47.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "inlet",
								"numinlets" : 0,
								"numoutlets" : 1,
								"id" : "obj-5",
								"outlettype" : [ "bang" ],
								"patching_rect" : [ 460.0, 30.0, 30.0, 30.0 ],
								"comment" : "",
								"index" : 3
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "button",
								"numinlets" : 1,
								"parameter_enable" : 0,
								"numoutlets" : 1,
								"id" : "obj-34",
								"outlettype" : [ "bang" ],
								"patching_rect" : [ 475.666665613651276, 107.333334505558014, 66.0, 66.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "route 0",
								"numinlets" : 2,
								"numoutlets" : 2,
								"id" : "obj-32",
								"outlettype" : [ "", "" ],
								"patching_rect" : [ 371.666667461395264, 178.0, 46.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "pack",
								"numinlets" : 2,
								"numoutlets" : 1,
								"id" : "obj-30",
								"outlettype" : [ "" ],
								"patching_rect" : [ 337.0, 732.0, 37.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "midiparse",
								"numinlets" : 1,
								"numoutlets" : 8,
								"id" : "obj-28",
								"outlettype" : [ "", "", "", "int", "int", "", "int", "" ],
								"patching_rect" : [ 211.0, 200.0, 92.5, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "midiformat",
								"numinlets" : 7,
								"numoutlets" : 2,
								"id" : "obj-25",
								"outlettype" : [ "int", "" ],
								"patching_rect" : [ 216.0, 785.0, 82.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "gswitch2",
								"numinlets" : 2,
								"parameter_enable" : 0,
								"numoutlets" : 2,
								"id" : "obj-40",
								"outlettype" : [ "", "" ],
								"patching_rect" : [ 191.0, 117.333334505558014, 39.0, 32.0 ],
								"int" : 1
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "t l b",
								"numinlets" : 1,
								"numoutlets" : 2,
								"id" : "obj-39",
								"outlettype" : [ "", "bang" ],
								"patching_rect" : [ 319.333338856697083, 295.00000274181366, 44.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "gate",
								"numinlets" : 2,
								"numoutlets" : 1,
								"id" : "obj-27",
								"outlettype" : [ "" ],
								"patching_rect" : [ 496.666665613651276, 388.333338856697083, 37.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "button",
								"numinlets" : 1,
								"parameter_enable" : 0,
								"numoutlets" : 1,
								"id" : "obj-26",
								"outlettype" : [ "bang" ],
								"patching_rect" : [ 496.666665613651276, 423.000006556510925, 24.0, 24.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "message",
								"text" : "1",
								"numinlets" : 2,
								"numoutlets" : 1,
								"id" : "obj-24",
								"outlettype" : [ "" ],
								"patching_rect" : [ 453.333342850208282, 577.666677832603455, 29.5, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "message",
								"text" : "0",
								"numinlets" : 2,
								"numoutlets" : 1,
								"id" : "obj-22",
								"outlettype" : [ "" ],
								"patching_rect" : [ 413.666667520999908, 577.666677832603455, 29.5, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "delay 10",
								"numinlets" : 2,
								"numoutlets" : 1,
								"id" : "obj-20",
								"outlettype" : [ "bang" ],
								"patching_rect" : [ 496.666665613651276, 468.000000536441803, 66.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "== 0",
								"numinlets" : 2,
								"numoutlets" : 1,
								"id" : "obj-17",
								"outlettype" : [ "int" ],
								"patching_rect" : [ 496.666665613651276, 333.999996542930603, 37.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "borax",
								"numinlets" : 3,
								"numoutlets" : 9,
								"id" : "obj-16",
								"outlettype" : [ "int", "int", "int", "int", "int", "int", "int", "int", "int" ],
								"patching_rect" : [ 371.666667461395264, 413.000005483627319, 103.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "toggle",
								"numinlets" : 1,
								"parameter_enable" : 0,
								"numoutlets" : 1,
								"id" : "obj-15",
								"outlettype" : [ "int" ],
								"patching_rect" : [ 360.999999284744263, 632.666671693325043, 24.0, 24.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "newobj",
								"text" : "sustain",
								"numinlets" : 3,
								"numoutlets" : 2,
								"id" : "obj-12",
								"outlettype" : [ "int", "int" ],
								"patching_rect" : [ 320.999999284744263, 669.666671335697174, 59.0, 22.0 ]
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "outlet",
								"numinlets" : 1,
								"numoutlets" : 0,
								"id" : "obj-4",
								"patching_rect" : [ 191.0, 860.0, 30.0, 30.0 ],
								"comment" : "",
								"index" : 1
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "inlet",
								"numinlets" : 0,
								"numoutlets" : 1,
								"id" : "obj-3",
								"outlettype" : [ "int" ],
								"patching_rect" : [ 311.000009179115295, 24.0, 30.0, 30.0 ],
								"comment" : "",
								"index" : 2
							}

						}
, 						{
							"box" : 							{
								"maxclass" : "inlet",
								"numinlets" : 0,
								"numoutlets" : 1,
								"id" : "obj-2",
								"outlettype" : [ "int" ],
								"patching_rect" : [ 192.833338856697083, 24.0, 30.0, 30.0 ],
								"comment" : "",
								"index" : 1
							}

						}
 ],
					"lines" : [ 						{
							"patchline" : 							{
								"source" : [ "obj-6", 0 ],
								"destination" : [ "obj-16", 0 ],
								"order" : 0
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-6", 1 ],
								"destination" : [ "obj-16", 1 ],
								"order" : 0
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-6", 0 ],
								"destination" : [ "obj-12", 0 ],
								"order" : 1
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-6", 1 ],
								"destination" : [ "obj-12", 1 ],
								"order" : 1
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-5", 0 ],
								"destination" : [ "obj-34", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-40", 0 ],
								"destination" : [ "obj-4", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-40", 1 ],
								"destination" : [ "obj-28", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-39", 0 ],
								"destination" : [ "obj-6", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-39", 1 ],
								"destination" : [ "obj-27", 1 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-34", 0 ],
								"destination" : [ "obj-26", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-32", 0 ],
								"destination" : [ "obj-26", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-30", 0 ],
								"destination" : [ "obj-25", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-3", 0 ],
								"destination" : [ "obj-40", 0 ],
								"order" : 1
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-3", 0 ],
								"destination" : [ "obj-32", 0 ],
								"order" : 0
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 0 ],
								"destination" : [ "obj-39", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 1 ],
								"destination" : [ "obj-25", 1 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 2 ],
								"destination" : [ "obj-25", 2 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 3 ],
								"destination" : [ "obj-25", 3 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 4 ],
								"destination" : [ "obj-25", 4 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 5 ],
								"destination" : [ "obj-25", 5 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-28", 6 ],
								"destination" : [ "obj-25", 6 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-27", 0 ],
								"destination" : [ "obj-26", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-26", 0 ],
								"destination" : [ "obj-22", 0 ],
								"order" : 1
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-26", 0 ],
								"destination" : [ "obj-20", 0 ],
								"order" : 0
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-25", 0 ],
								"destination" : [ "obj-4", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-24", 0 ],
								"destination" : [ "obj-15", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-22", 0 ],
								"destination" : [ "obj-15", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-20", 0 ],
								"destination" : [ "obj-24", 0 ],
								"midpoints" : [ 506.166665613651276, 563.0, 462.833342850208282, 563.0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-2", 0 ],
								"destination" : [ "obj-40", 1 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-17", 0 ],
								"destination" : [ "obj-27", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-16", 2 ],
								"destination" : [ "obj-17", 0 ],
								"midpoints" : [ 402.166667461395264, 449.0, 481.999999284744263, 449.0, 481.999999284744263, 329.0, 506.166665613651276, 329.0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-15", 0 ],
								"destination" : [ "obj-12", 2 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-12", 0 ],
								"destination" : [ "obj-30", 0 ]
							}

						}
, 						{
							"patchline" : 							{
								"source" : [ "obj-12", 1 ],
								"destination" : [ "obj-30", 1 ]
							}

						}
 ],
					"styles" : [ 						{
							"name" : "Nord",
							"default" : 							{
								"color" : [ 0.56078431372549, 0.737254901960784, 0.733333333333333, 1.0 ],
								"fontname" : [ "Source Code Pro" ],
								"textcolor_inverse" : [ 0.925490196078431, 0.937254901960784, 0.956862745098039, 1.0 ],
								"bgcolor" : [ 0.298039215686275, 0.337254901960784, 0.415686274509804, 1.0 ],
								"locked_bgcolor" : [ 0.180392156862745, 0.203921568627451, 0.250980392156863, 1.0 ],
								"clearcolor" : [ 0.180392156862745, 0.203921568627451, 0.250980392156863, 1.0 ],
								"bgfillcolor" : 								{
									"type" : "gradient",
									"color1" : [ 0.376471, 0.384314, 0.4, 1.0 ],
									"color2" : [ 0.290196, 0.309804, 0.301961, 1.0 ],
									"color" : [ 0.290196, 0.309804, 0.301961, 1.0 ],
									"angle" : 270.0,
									"proportion" : 0.39
								}
,
								"stripecolor" : [ 0.180392156862745, 0.203921568627451, 0.250980392156863, 1.0 ],
								"editing_bgcolor" : [ 0.231372549019608, 0.258823529411765, 0.32156862745098, 1.0 ],
								"textcolor" : [ 0.847058823529412, 0.870588235294118, 0.913725490196078, 1.0 ],
								"accentcolor" : [ 0.505882352941176, 0.631372549019608, 0.756862745098039, 1.0 ],
								"elementcolor" : [ 1.0, 1.0, 1.0, 1.0 ],
								"selectioncolor" : [ 0.92156862745098, 0.796078431372549, 0.545098039215686, 1.0 ]
							}
,
							"parentstyle" : "",
							"multi" : 0
						}
 ]
				}
,
				"saved_object_attributes" : 				{
					"description" : "",
					"digest" : "",
					"globalpatchername" : "",
					"tags" : ""
				}

			}

		}
 ],
	"appversion" : 	{
		"major" : 8,
		"minor" : 1,
		"revision" : 8,
		"architecture" : "x64",
		"modernui" : 1
	}
,
	"styles" : [ 		{
			"name" : "Nord",
			"default" : 			{
				"color" : [ 0.56078431372549, 0.737254901960784, 0.733333333333333, 1.0 ],
				"fontname" : [ "Source Code Pro" ],
				"textcolor_inverse" : [ 0.925490196078431, 0.937254901960784, 0.956862745098039, 1.0 ],
				"bgcolor" : [ 0.298039215686275, 0.337254901960784, 0.415686274509804, 1.0 ],
				"locked_bgcolor" : [ 0.180392156862745, 0.203921568627451, 0.250980392156863, 1.0 ],
				"clearcolor" : [ 0.180392156862745, 0.203921568627451, 0.250980392156863, 1.0 ],
				"bgfillcolor" : 				{
					"type" : "gradient",
					"color1" : [ 0.376471, 0.384314, 0.4, 1.0 ],
					"color2" : [ 0.290196, 0.309804, 0.301961, 1.0 ],
					"color" : [ 0.290196, 0.309804, 0.301961, 1.0 ],
					"angle" : 270.0,
					"proportion" : 0.39
				}
,
				"stripecolor" : [ 0.180392156862745, 0.203921568627451, 0.250980392156863, 1.0 ],
				"editing_bgcolor" : [ 0.231372549019608, 0.258823529411765, 0.32156862745098, 1.0 ],
				"textcolor" : [ 0.847058823529412, 0.870588235294118, 0.913725490196078, 1.0 ],
				"accentcolor" : [ 0.505882352941176, 0.631372549019608, 0.756862745098039, 1.0 ],
				"elementcolor" : [ 1.0, 1.0, 1.0, 1.0 ],
				"selectioncolor" : [ 0.92156862745098, 0.796078431372549, 0.545098039215686, 1.0 ]
			}
,
			"parentstyle" : "",
			"multi" : 0
		}
 ],
	"classnamespace" : "box"
}
```
